Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeUnConnError Property
 The selected fitting(s) cannot successfully change the type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationPartCannotChangeTypeUnConnError { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartCannotChangeTypeUnConnError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeUnConnError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace